app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id]
      begin
        @artist = Artist.find(params[:artist_id])
      rescue ActiveRecord::RecordNotFound
        flash[:alert] = "Artist not found"
        redirect_to '/artists'
      end
    end

    if @artist
      @songs = @artist.songs
    else
      @songs = Song.all

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    begin
      @song = Song.find(params[:id])
    rescue ActiveRecord::RecordNotFound
      flash[:alert] = "Song not found"
      @artist = Artist.find_by(id: params[:artist_id])